Generate Documentation (.php)
